## What is a Data Warehouse? A Business Perspective
You are in charge of a retailer’s data infrastructure. Let’s look at some business activities.

* **Customers** should be able to find goods & make orders
* **Inventory Staff** should be able to stock, retrieve, and re-order goods
* **Delivery Staff** should be able to pick up & deliver goods
* **HR** should be able to assess the performance of sales staff
* **Marketing** should be able to see the effect of different sales channels
* **Management** should be able to monitor sales growth

Ask yourself: Can I build a database to support these activities? Are all of the above questions of the same nature?
Let's take a closer look at details that may affect your data infrastructure.

* Retailer has a nation-wide presence → **Scale**?
* Acquired smaller retailers, brick & mortar shops, online store → **Single database? Complexity**?
* Has support call center & social media accounts → **Tabular data**?
* Customers, Inventory Staff and Delivery staff expect the system to be fast & stable → **Performance**
* HR, Marketing & Sales Reports want a lot information but have not decided yet on everything they need → **Clear Requirements**?
Ok, maybe one single relational database won’t suffice :)

## Operational Vs Analytical Processes
### Operational Processes
**Make it work!**
* Find goods and make orders (for customers)
* Stock and find goods (for inventory staff)
* Pick up and deliver goods (for delivery staff)

### Analytical Processes
**What is going on?**
* Assesses the performance of sales staff (for HR)
* See the effect of different sales channels (for marketing)
* Monitor sales growth (for management)

<img src=images/operational_analytical_prcoess.png>
<img src= images/OLTPVsOLAP.png>

### QUESTION 1 OF 3
Match the following examples of business processes with the type of process (operational vs. analytical) each would be considered.

|EXAMPLE OF BUSINESS PROCESS |TYPE OF PROCESS|
|---------------------------|----------------|
|Need to track inventory|Operational Process|
|Examine market segmentation over a period of time|Analytical Process|
|Split customers into market segments for market optimization|Analytical Process|
|Track financial transactions|Operational Process|
|Track shipment of customer orders|Operational Process|

### QUESTION 2 OF 3
A Data Warehouse...
- [x] is optimized to support processes for data analysis.
- [ ] is designed for OLTP transactions only.
- [x] has data gathered from multiple sources.
- [x] is an Online Analytical Processing System.

### QUESTION 3 OF 3
What happens if we use the same database for both OLAP and OLTP?
- [x] The database schema will be hard to understand for business analysts
- [x] The analytical queries will be slow as we will have to perform lots of table joins
- [ ] The database schema will be easy to understand for business analysts
- [ ] The analytical queries will run faster as they are executed on the same
- [x] It might be totally ok if the database is small

## Data Warehouse: Technical Perspective
### Data Warehouse Definition 1
A data warehouse is a copy of transaction data specifically structured for query and analysis.

### Data Warehouse Definition 2
A data warehouse is a **subject-oriented**, **integrated**, **nonvolatile** and **time-variant** collection of data in support of management's decisions.

### Data Warehouse Definition 3
A data warehouse is a system that **retrieves** and **consolidates** data **periodically** for the source systems into **dimensional** or **normalized** data store. It usually **keeps years of history** and is **queried for business intelligence** or other **analytical activities**. It is typically **updated in batches**, not every time a transaction happens in the source system.

<img src = images/DWH_ETL.png>
<img src="images/DWH_Dimensional_Model.png">

### Data Warehouse Goals
* Simple to understand
* Performance
* Quality Assured
* Handles new questions well
* Secure

## Dimensional Modeling

<img src=images/StarVs3NF.png>

### Facts & Dimensions
**Fact tables**
* Record business events, like an order, a phone call, a book review.
* Fact table columns record events recorded in quantifiable **metrics** like quantity of an item, duration of a call, a book rating

**Dimension tables**
* Record the context of the business events, e.g who, what. where, why, etc.
* Dimension tables columns contains **attributes** like the store at which an item is purchased, or the customer who made the call, etc.. 

### Fact or Dimension Dilemma
* For facts, if you're unsure if a column is a fact or dimension, the simplest rule is that a fact is usually: **Numeric & Additive**
* Example facts:
    * A comment on an article represents an event but we an not easily make a statistics out its content per se (Not a good fact)
    * Invoice number is numeric but adding it does not make sense (Not a good fact)
    * Total number of invoice could be added to computer total sales (A good fact)
    
* Example dimensions:
    * Date & time are always dimension
    * Physical locations and their attributes are good candidates dimensions
    * Human Roles like customers and staff always good candidates for dimensions
    * Goods sold always good candidates for dimensions

### Example: The DVD Rentals Sample Database
* To master the art of dimensional Modeling, one needs to see lots of schemas and think about how to design facts & dimensions from them
* We will start by a relatively small example for a classical database sample for a DVD rentals shop called Sakila sample database

### Example: The DVD Rentals Sample Database
<img src='images/SakilaDatabase.png'>

**Q1: How easy it is for you to understand this database schema?**

Not that complicated, since it is small but not simple to analyze for business users.

**Q2: Can you spot candidates for a fact table?**

rentals? payments

**Q3: Can you spot candidates for dimension tables?**

Customer, Store, Staff, film... what about the rest?

<img src=images/3NFVsStar.png>

### Naive ETL: From 3NF to ETL
* Query the 3NF DB (**Extract**)
    * Join tables together (**Transform**)    
    * Change types (**Transform**)
    * Add new columns (**Transform**)
* Loading (**LOAD**)
    * Insert into facts & dimension tables
    
### QUESTION 1 OF 2
Match the type of data being captured in a table with the type of table (Fact VS. Dimension) it would be best captured in.

|TYPE OF DATA |FACT VS. DIMENSION TABLE|
|-------------|------------------------|
|Number of items bought by a customer|Fact table|
|Type of shirt ordered by the customer|Dimension table|
|Instances of positive feedback from customer|Fact table|
|Type of furniture the customer was browsing on an online furniture website|Dimension table|
|Number of shares sold for a specific company|Fact table|

### QUESTION 2 OF 2
Match the type of data being captured in a table with the type of table (Fact VS. Dimension) it would be best captured in.

|TYPE OF DATA |FACT VS. DIMENSION TABLE|
|-------------|------------------------|
|Length of phone call a customer service rep attended to resolution.|Fact table|
|Location of the store|Dimension table|
|Date when customer placed the order for 4 shirts.|Dimension table|
|Employee ID of the sales person who made the sale|Dimension table|

## Exercise 1 -  Sakila Star Schema & ETL  

All the database tables in this demo are based on public database samples and transformations
- `Sakila` is a sample database created by `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](http://archive.oreilly.com/oreillyschool/courses/dba3/index.html)

### STEP0: Using ipython-sql

- Load ipython-sql: `%load_ext sql`

- To execute SQL queries you write one of the following atop of your cell: 
    - `%sql`
        - For a one-liner SQL query
        - You can access a python var using `$`    
    - `%%sql`
        - For a multi-line SQL query
        - You can **NOT** access a python var using `$`


- Running a connection string like:
`postgresql://postgres:postgres@db:5432/pagila` connects to the database

### STEP1 : Connect to the local database where Pagila is loaded

####  1.1 Create the pagila db and fill it with data
- Adding `"!"` at the beginning of a jupyter cell runs a command in a shell, i.e. we are not running python code but we are running the `createdb` and `psql` postgresql commmand-line utilities

In [ ]:
# !set PGPASSWORD=student && createdb -h 127.0.0.1 -U student pagila
# !set PGPASSWORD=student && psql -q -h 127.0.0.1 -U student -d pagila -f data/pagila-schema.sql
# !set PGPASSWORD=student && psql -q -h 127.0.0.1 -U student -d pagila -f data/pagila-data.sql

#### 1.2 Connect to the newly created db

In [1]:
%load_ext sql

In [2]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}"\
                .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://student:student@127.0.0.1:5432/pagila

In [3]:
%sql $conn_string

'Connected: student@pagila'

### STEP2 : Explore the  3NF Schema

<img src="images/pagila-3nf.png" width="50%"/>

#### 2.1 How much? What data sizes are we looking at?

In [4]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;

print("nFilms\t\t=", nFilms[0][0])
print("nCustomers\t=", nCustomers[0][0])
print("nRentals\t=", nRentals[0][0])
print("nPayment\t=", nPayment[0][0])
print("nStaff\t\t=", nStaff[0][0])
print("nStores\t\t=", nStores[0][0])
print("nCities\t\t=", nCity[0][0])
print("nCountry\t\t=", nCountry[0][0])

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 16049
nStaff		= 2
nStores		= 2
nCities		= 600
nCountry		= 109

#### 2.2 When? What time period are we talking about?

In [5]:
%%sql
SELECT MIN(payment_date) AS start, MAX(payment_date) AS end 
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), datetime.datetime(2017, 5, 14, 13, 44, 29, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)))]

#### 2.3 Where? Where do events in this database occur?
Write a query that displays the number of addresses by district in the address table. Limit the table to the top 10 districts. Your results should match the table below.

In [6]:
%%sql
SELECT district, COUNT(*) AS n 
FROM address
GROUP BY district 
ORDER BY n DESC, district ASC
LIMIT 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('Buenos Aires', 10),
 ('California', 9),
 ('Shandong', 9),
 ('West Bengali', 9),
 ('So Paulo', 8),
 ('Uttar Pradesh', 8),
 ('England', 7),
 ('Maharashtra', 7),
 ('Southern Tagalog', 6),
 ('Gois', 5)]

### STEP3: Perform some simple data analysis

Start by connecting to the database by running the cells below. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 and 2, then skip to the second cell.

In [7]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://student:student@127.0.0.1:5432/pagila

'Connected: student@pagila'

#### 3NF - Entity Relationship Diagram

<img src="images/pagila-3nf.png" width="50%"/>

#### 3.1 Insight 1:   Top Grossing Movies 
- Payments amounts are in table `payment`
- Movies are in table `film`
- They are not directly linked, `payment` refers to a `rental`, `rental` refers to an `inventory` item and `inventory` item refers to a `film`
- `payment` &rarr; `rental` &rarr; `inventory` &rarr; `film`

##### 3.1.1 Films

In [8]:
%%sql 
SELECT film_id, title, release_year, rental_rate, rating
FROM film 
LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2006, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2006, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2006, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2006, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2006, Decimal('2.99'), 'G')]

##### 3.1.2 Payments

In [9]:
%%sql
SELECT * 
FROM payment 
LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2017, 1, 24, 21, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2017, 1, 25, 15, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2017, 1, 28, 21, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2017, 1, 29, 0, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2017, 1, 29, 8, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

##### 3.1.4 Inventory

In [10]:
%%sql
SELECT *
FROM inventory 
LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (2, 1, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (3, 1, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (4, 1, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (5, 1, 2, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

##### 3.1.4 Get the movie of every payment

In [11]:
%%sql
SELECT f.title, p.payment_id, p.customer_id, p.amount
FROM payment p 
    JOIN rental r ON p.rental_id = r.rental_id
    JOIN inventory i ON r.inventory_id = i.inventory_id
    JOIN film f ON i.film_id = f.film_id
LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[('SWARM GOLD', 16050, 269, Decimal('1.99')),
 ('PACKER MADIGAN', 16051, 269, Decimal('0.99')),
 ('SOMETHING DUCK', 16052, 269, Decimal('6.99')),
 ('DRACULA CRYSTAL', 16053, 269, Decimal('0.99')),
 ('CLOSER BANG', 16054, 269, Decimal('4.99'))]

##### 3.1.5 sum movie rental revenue
Write a query that displays the amount of revenue from each title. Limit the results to the top 10 grossing titles. Your results should match the table below.

In [12]:
%%sql
SELECT f.title, SUM(p.amount) AS revenue
FROM payment p 
    JOIN rental r ON p.rental_id = r.rental_id
    JOIN inventory i ON r.inventory_id = i.inventory_id
    JOIN film f ON i.film_id = f.film_id
GROUP BY f.title
ORDER BY revenue DESC
LIMIT 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72')),
 ('TITANS JERK', Decimal('201.71')),
 ('TORQUE BOUND', Decimal('198.72')),
 ('HARRY IDAHO', Decimal('195.70')),
 ('INNOCENT USUAL', Decimal('191.74')),
 ('HUSTLER PARTY', Decimal('190.78'))]

#### 3.2 Insight 2:   Top grossing cities 
- Payments amounts are in table `payment`
- Cities are in table `cities`
- `payment` &rarr; `customer` &rarr; `address` &rarr; `city`

##### 3.2.1 Get the city of each payment

In [13]:
%%sql
SELECT p.customer_id, p.rental_id, p.amount, ci.city 
FROM payment p
    JOIN customer c ON p.customer_id = c.customer_id
    JOIN address a ON c.address_id = a.address_id
    JOIN city ci ON a.city_id = ci.city_id
order by p.payment_date
LIMIT 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(130, 1, Decimal('2.99'), 'guas Lindas de Gois'),
 (459, 2, Decimal('2.99'), 'Qomsheh'),
 (408, 3, Decimal('3.99'), 'Jaffna'),
 (333, 4, Decimal('4.99'), 'Baku'),
 (222, 5, Decimal('6.99'), 'Jaroslavl'),
 (549, 6, Decimal('0.99'), 'Santiago de Compostela'),
 (269, 7, Decimal('1.99'), 'Salinas'),
 (239, 8, Decimal('4.99'), 'Ciomas'),
 (126, 9, Decimal('4.99'), 'Po'),
 (399, 10, Decimal('5.99'), 'Okara')]

##### 3.2.2 Top grossing cities
Write a query that returns the total amount of revenue by city as measured by the `amount` variable in the `payment` table. Limit the results to the top 10 cities. Your result should match the table below.

In [14]:
%%sql
SELECT ci.city, SUM(p.amount) AS revenue
FROM payment p
    JOIN customer c ON p.customer_id = c.customer_id
    JOIN address a ON c.address_id = a.address_id
    JOIN city ci ON a.city_id = ci.city_id
GROUP BY ci.city
ORDER BY revenue DESC
LIMIT 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('194.61')),
 ('Qomsheh', Decimal('186.62')),
 ('London', Decimal('180.52')),
 ('Ourense (Orense)', Decimal('177.60')),
 ('Bijapur', Decimal('175.61'))]

#### 3.3 Insight 3 : Revenue of a movie by customer city and by month

##### 3.3.1 Total revenue by month

In [15]:
%%sql
SELECT SUM(p.amount) as revenue, EXTRACT(month FROM p.payment_date) AS month
FROM payment p
GROUP BY month
ORDER BY revenue DESC
LIMIT 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(Decimal('28559.46'), 4.0),
 (Decimal('23886.56'), 3.0),
 (Decimal('9631.88'), 2.0),
 (Decimal('4824.43'), 1.0),
 (Decimal('514.18'), 5.0)]

##### 3.3.2 Each movie by customer city and by month (data cube)

In [16]:
%%sql
SELECT f.title, p.amount, p.customer_id, ci.city,
       p.payment_date,EXTRACT(month FROM p.payment_date) AS month
FROM payment p
    JOIN rental r ON p.rental_id = r.rental_id
    JOIN inventory i ON r.inventory_id = i.inventory_id
    JOIN film f ON i.film_id = f.film_id
    JOIN customer c  ON p.customer_id = c.customer_id 
    JOIN address a ON c.address_id = a.address_id 
    JOIN city ci ON a.city_id = ci.city_id 
ORDER BY p.payment_date
LIMIT 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('BLANKET BEVERLY', Decimal('2.99'), 130, 'guas Lindas de Gois', datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('FREAKY POCUS', Decimal('2.99'), 459, 'Qomsheh', datetime.datetime(2017, 1, 24, 21, 22, 59, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('GRADUATE LORD', Decimal('3.99'), 408, 'Jaffna', datetime.datetime(2017, 1, 24, 21, 32, 5, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('LOVE SUICIDES', Decimal('4.99'), 333, 'Baku', datetime.datetime(2017, 1, 24, 21, 33, 7, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('IDOLS SNATCHERS', Decimal('6.99'), 222, 'Jaroslavl', datetime.datetime(2017, 1, 24, 21, 33, 47, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('MYSTIC TRUMAN', Decimal('0.99'), 549, 'Santiago de Compostela', datetime.datetime(2017, 1, 24, 21, 36, 33, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('SWARM GOLD', Decimal('1.99'), 269, 'Salinas', datetime.datetime(2017, 1, 24, 21, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('LAWLESS VISION', Decimal('4.99'), 239, 'Ciomas', datetime.datetime(2017, 1, 24, 22, 0, 12, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('MATRIX SNOWMAN', Decimal('4.99'), 126, 'Po', datetime.datetime(2017, 1, 24, 22, 29, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('HANGING DEEP', Decimal('5.99'), 399, 'Okara', datetime.datetime(2017, 1, 24, 22, 30, 47, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0)]

##### 3.3.3 Sum of revenue of each movie by customer city and by month
Write a query that returns the total amount of revenue for each movie by customer city and by month. Limit the results to the top 10 movies.

In [17]:
%%sql
SELECT f.title, ci.city,EXTRACT(month FROM p.payment_date) AS month,
       SUM(p.amount) AS revenue
FROM payment p
    JOIN rental r ON p.rental_id = r.rental_id
    JOIN inventory i ON r.inventory_id = i.inventory_id
    JOIN film f ON i.film_id = f.film_id
    JOIN customer c  ON p.customer_id = c.customer_id 
    JOIN address a ON c.address_id = a.address_id 
    JOIN city ci ON a.city_id = ci.city_id 
GROUP BY f.title, ci.city, month
ORDER BY month, revenue DESC
LIMIT 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('SHOW LORD', 'Mannheim', 1.0, Decimal('11.99')),
 ('CASUALTIES ENCINO', 'Warren', 1.0, Decimal('10.99')),
 ('KISSING DOLLS', 'Toulon', 1.0, Decimal('10.99')),
 ('AMERICAN CIRCUS', 'Callao', 1.0, Decimal('10.99')),
 ('TELEGRAPH VOYAGE', 'Naala-Porto', 1.0, Decimal('10.99')),
 ('STRANGER STRANGERS', 'Ipoh', 1.0, Decimal('9.99')),
 ('HEAD STRANGER', 'Xiangtan', 1.0, Decimal('9.99')),
 ('MISSION ZOOLANDER', 'Abha', 1.0, Decimal('9.99')),
 ('MILLION ACE', 'Gaziantep', 1.0, Decimal('9.99')),
 ('DARKO DORADO', 'Bhilwara', 1.0, Decimal('9.99'))]

### STEP4: Creating Facts & Dimensions
<img src="images/pagila-star.png">

#### 4.1 Create the first dimension table
Create the dimDate dimension table with the fields and data types shown in the ERD above.

In [57]:
%%sql
CREATE TABLE IF NOT EXISTS dimDate
(
    date_key INT NOT NULL PRIMARY KEY,
    date DATE,
    year INT NOT NULL,
    quater INT NOT NULL,
    month INT NOT NULL,
    day INT NOT NULL,
    week INT NOT NULL,
    is_weekend BOOLEAN NOT NULL
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

To check your work, run the following query to see a table with the field names and data types. The output should match the table below.

In [58]:
%%sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name   = 'dimdate'

 * postgresql://student:***@127.0.0.1:5432/pagila
8 rows affected.

[('date_key', 'integer'),
 ('year', 'integer'),
 ('quarter', 'integer'),
 ('month', 'integer'),
 ('day', 'integer'),
 ('week', 'integer'),
 ('is_weekend', 'boolean'),
 ('date', 'date')]

Run the cell below to create the rest of the dimension tables.

In [35]:
%%sql
CREATE TABLE IF NOT EXISTS dimCustomer
(
  customer_key SERIAL PRIMARY KEY,
  customer_id  smallint NOT NULL,
  first_name   varchar(45) NOT NULL,
  last_name    varchar(45) NOT NULL,
  email        varchar(50),
  address      varchar(50) NOT NULL,
  address2     varchar(50),
  district     varchar(20) NOT NULL,
  city         varchar(50) NOT NULL,
  country      varchar(50) NOT NULL,
  postal_code  varchar(10),
  phone        varchar(20) NOT NULL,
  active       smallint NOT NULL,
  create_date  timestamp NOT NULL,
  start_date   date NOT NULL,
  end_date     date NOT NULL
);

CREATE TABLE IF NOT EXISTS dimMovie
(
  movie_key          SERIAL PRIMARY KEY,
  film_id            smallint NOT NULL,
  title              varchar(255) NOT NULL,
  description        text,
  release_year       year,
  language           varchar(20) NOT NULL,
  original_language  varchar(20),
  rental_duration    smallint NOT NULL,
  length             smallint NOT NULL,
  rating             varchar(5) NOT NULL,
  special_features   varchar(60) NOT NULL
);
CREATE TABLE IF NOT EXISTS dimStore
(
  store_key           SERIAL PRIMARY KEY,
  store_id            smallint NOT NULL,
  address             varchar(50) NOT NULL,
  address2            varchar(50),
  district            varchar(20) NOT NULL,
  city                varchar(50) NOT NULL,
  country             varchar(50) NOT NULL,
  postal_code         varchar(10),
  manager_first_name  varchar(45) NOT NULL,
  manager_last_name   varchar(45) NOT NULL,
  start_date          date NOT NULL,
  end_date            date NOT NULL
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.
Done.
Done.

[]

#### 4.2 Create the fact table
Create the factSales table with the fields and data types shown in the ERD above. 

**Note on REFERENCES constraints:**<br> 
The demo video does not cover the REFERENCES constraint. When building a fact table, you use the REFERENCES constrain to identify which table and column a foreign key is connected to. This ensures that the fact table does not refer to items that do not appear in the respective dimension tables. You can read more [here](https://www.postgresql.org/docs/9.2/ddl-constraints.html). Here's an example of the syntax on a different schema:

```
CREATE TABLE orders (
    order_id integer PRIMARY KEY,
    product_no integer REFERENCES products (product_no),
    quantity integer
);
```

In [36]:
%%sql
CREATE TABLE IF NOT EXISTS factsales(
    sales_key INT NOT NULL PRIMARY KEY,
    date_key INT NOT NULL REFERENCES dimdate(date_key),
    customer_key INT NOT NULL REFERENCES dimcustomer(customer_key),
    movie_key INT NOT NULL REFERENCES dimmovie(movie_key),
    store_key INT NOT NULL REFERENCES dimstore(store_key),
    sales_amount INT NOT NULL
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

### STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables

#### 5.1 Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

In [37]:
%%sql
CREATE TABLE test_table(
    date TIMESTAMP,
    revenue DECIMAL(5,2)
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [38]:
%%sql
INSERT INTO test_table(date,revenue)
    SELECT payment_date AS date,
    amount AS revenue
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

Then you can use a SELECT statement to take a look at your new table.

In [39]:
%sql SELECT * FROM test_table LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(datetime.datetime(2017, 1, 24, 21, 40, 19, 996577), Decimal('1.99')),
 (datetime.datetime(2017, 1, 25, 15, 16, 50, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 28, 21, 44, 14, 996577), Decimal('6.99')),
 (datetime.datetime(2017, 1, 29, 0, 58, 2, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 29, 8, 10, 6, 996577), Decimal('4.99'))]

If you need to delete the table and start over, use the DROP TABLE command, like below.

In [40]:
%sql DROP TABLE test_table

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

#### 5.2 ETL from 3NF to Star Schema

In this section, you'll populate the tables in the Star schema. You'll `extract` data from the normalized database, `transform` it, and `load` it into the new tables. 

To serve as an example, below is the query that populates the `dimDate` table with data from the `payment` table.
* NOTE 1: The EXTRACT function extracts date parts from the payment_date variable.

In [60]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) 
            THEN true ELSE false END                                AS is_weekend
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila

IntegrityError: (psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "dimdate_pkey"
DETAIL:  Key (date_key)=(20170407) already exists.

[SQL: INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7)
            THEN true ELSE false END                                AS is_weekend
FROM payment;]
(Background on this error at: http://sqlalche.me/e/gkpj)

Populate the `dimCustomer` table with data from the `customer`, `address`, `city`, and `country` tables. Use the starter code as a guide.

In [64]:
%%sql
INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT c.customer_id AS customer_key,
    c.customer_id,
    c.first_name,
    c.last_name,
    c.email,
    a.address,
    a.address2,
    a.district,
    ci.city,
    co.country,
    a.postal_code,
    a.phone,
    c.active,
    c.create_date,
    NOW() AS start_date,
    NOW() AS end_date
FROM customer c JOIN address a ON c.address_id = a.address_id
    JOIN city ci ON a.city_id = ci.city_id
    JOIN country co ON ci.country_id = co.country_id;

 * postgresql://student:***@127.0.0.1:5432/pagila
599 rows affected.

[]

Populate the `dimMovie` table with data from the `film` and `language` tables. Use the starter code as a guide.

In [69]:
%%sql
INSERT INTO dimmovie(film_id, title, description, release_year, 
                     language, original_language, rental_duration,
                     length, rating, special_features)
SELECT f.film_id,
    f.title,
    f.description,
    f.release_year,
    l.name AS language,
    orig_lang.name AS orginal_language,
    f.rental_duration,
    f.length,
    f.rating,
    f.special_features
FROM film f JOIN language l ON f.language_id = l.language_id
    LEFT JOIN language orig_lang ON f.original_language_id = orig_lang.language_id;

 * postgresql://student:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

Populate the `dimStore` table with data from the `store`, `staff`, `address`, `city`, and `country` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [70]:
%%sql
INSERT INTO dimstore(store_key, store_id, address, address2, district,
                     city, country, postal_code, manager_first_name,
                     manager_last_name, start_date, end_date)
SELECT s.store_id AS store_key,
    s.store_id,
    a.address,
    a.address2,
    a.district,
    ci.city,
    co.country,
    a.postal_code,
    m.first_name AS manager_first_name,
    m.last_name AS manager_last_name,
    NOW() AS start_date,
    NOW() AS end_date
FROM store s JOIN address a ON s.address_id = a.address_id
    JOIN city ci ON a.city_id = ci.city_id
    JOIN country co ON ci.country_id = co.country_id
    JOIN staff m ON s.manager_staff_id = m.staff_id
;

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[]

Populate the `factSales` table with data from the `payment`, `rental`, and `inventory` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [74]:
%%sql
INSERT INTO factsales(sales_key, date_key, customer_key,
                      movie_key, store_key, sales_amount)
SELECT p.payment_id AS sales_key,
    TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer AS date_key,
    r.customer_id AS customer_key,
    i.film_id AS movie_key,
    i.store_id AS store_key,
    p.amount AS sales_amount
FROM payment p JOIN rental r ON p.rental_id = r.rental_id
    JOIN inventory i ON r.inventory_id = i.inventory_id;

 * postgresql://student:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

### STEP 6: Repeat the computation from the facts & dimension table

#### 6.1 Facts Table has all the needed dimensions, no need for deep joins

In [75]:
%%time
%%sql
SELECT movie_key, date_key, customer_key, sales_amount
FROM factSales 
limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.
Wall time: 6.92 ms

[(870, 20170124, 269, 2),
 (651, 20170125, 269, 1),
 (818, 20170128, 269, 7),
 (249, 20170129, 269, 1),
 (159, 20170129, 269, 5)]

#### 6.2 Join fact table with dimensions to replace keys with attributes

As you run each cell, pay attention to the time that is printed. Which schema do you think will run faster?

##### Star Schema

In [77]:
%%time
%%sql
SELECT dimMovie.title, dimDate.month, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales 
JOIN dimMovie    on (dimMovie.movie_key      = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
group by (dimMovie.title, dimDate.month, dimCustomer.city)
order by dimMovie.title, dimDate.month, dimCustomer.city, revenue desc
LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.
Wall time: 38.6 ms

[('ACADEMY DINOSAUR', 1, 'Celaya', 1),
 ('ACADEMY DINOSAUR', 1, 'Cianjur', 2),
 ('ACADEMY DINOSAUR', 2, 'San Lorenzo', 1),
 ('ACADEMY DINOSAUR', 2, 'Sullana', 2),
 ('ACADEMY DINOSAUR', 2, 'Udaipur', 1)]

##### 3NF Schema

In [79]:
%%time
%%sql
SELECT f.title, EXTRACT(month FROM p.payment_date) as month, ci.city, sum(p.amount) as revenue
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by (f.title, month, ci.city)
order by f.title, month, ci.city, revenue desc
LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.
Wall time: 75.8 ms

[('ACADEMY DINOSAUR', 1.0, 'Celaya', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 1.0, 'Cianjur', Decimal('1.99')),
 ('ACADEMY DINOSAUR', 2.0, 'San Lorenzo', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 2.0, 'Sullana', Decimal('1.99')),
 ('ACADEMY DINOSAUR', 2.0, 'Udaipur', Decimal('0.99'))]

### Conclusion
We were able to show that:
* The star schema is easier to understand and write queries against.
* Queries with a star schema are more performant.

## Data Warehouse Architectures
* Kimball's Bus Architecture
* Independent Data Marts
* Inmon's Corporate Information Factory (CIF)
* Hybrid Bus & CIF

<img src=images/Kimball_Architecture.png>

<img src="images/Kimball_Bus.png">

### ETL: A Closer Look
* ETL:
    * Extracting:
        * Get data from its source
        * Possibly deleting old state
    * Transforming:
        * Integrates many sources together
        * Possibly cleansing: inconsistencies, duplication, missing values, etc..
        * Possibly producing diagnostic meta-data
    * Loading:
        * Structuring and loading the data into the dimensional data model
        
### QUESTION 1 OF 2
Identify the main characteristics of the Kimball Bus Architecture:

- [x] Results in a common dimension data model shared by different departments
- [ ] Organized by the departments using the data, not by the business process
- [x] Data is not kept at the aggregated level, but rather at the atomic level
- [x] Organized by business processes, and used by different departments 

### QUESTION 2 OF 2
In the Kimball architecture, the sales analytics and the delivery analytics will both use the same data dimension
- [x] True
- [ ] False

## DWH Architecture: Independent Data Marts
<img src=images/Independent_Data_Marts.png>

* Departments have independent ETL processes & dimensional models
* These **separate & smaller** dimensional models are called "Data Marts"
* Different fact tables for the same events, **no conformed dimensions**
* Uncoordinated efforts can lead to **inconsistent views**
* Despite awareness of the emergence of this architecture from departmental autonomy, it is generally discouraged

### QUESTION 1 OF 2
**True or False:**
Independent Data Marts have ETL processes that are designed by specific business departments to meet their analytical needs.
- [x] True
- [ ] False

### QUESTION 2 OF 2
**True or False:**
Independent Data Marts are highly encouraged to help business departments meet their analytic needs.
- [ ] True
- [x] False

## DWH Architecture: CIF
<img src="images/CIF.png">

### Data Marts
* 2 ETL Process
    * Source Systems &rarr; 3NF DB
    * 3NF DB &rarr; Departmental Data Marts
* The 3NF DB acts as an enterprise wide data store.
    * Single integrated source of truth for data-marts
    * Could be accessed by end-users if needed
* Data marts dimensionally modeled & unlike Kimball's dimensional models, they are mostly aggregated.    

### QUIZ QUESTION
Which of these statements describe the Corporate Information Factory (CIF) data warehouse architecture?
- [ ] The Data Marts use distinct ETL processes that can lead to inconsistencies
- [x] The Enterprise Data Warehouse provides a normalized data architecture before individual departments build on it.
- [x] The Data Marts use a source 3NF model and add denormalization based on department needs.
- [x] Was pioneered by Bill Inmon.

## DWH Architecture: Hybrid Bus & CIF
<img src=images/hybrid.png>

### QUIZ QUESTION
**True or False:**
The Hybrid Kimball Bus and Inmon CIF model has a heavy focus on Data Marts allowing department to individualize the data ETL process and denormalized data tables.
- [ ] True
- [x] False

## OLAP Cubes
<img src=images/olap_cubes.png>

## OLAP Cubes: Roll-Up and Drill Down
* **Roll-up**: Sum up the sales of each city by Country: e.g. US, France (less columns in branch dimension)
* **Drill-Down**: Decompose the sales of each city into smaller districts (more columns in branch dimension)
* The OLAP cubes should store the finest grain of data (atomic data), in case we need to drill-down to the lowest level, e.g. Country &rarr; City &rarr; District &rarr; Street, etc..

## OLAP Cubes: Slice and Dice
<img src=images/OLAP_Cubes_slice.png>
<img src=images/OLAP_Cubes_dice.png>

### QUIZ QUESTION
Match the OLAP operation to the correct definition.

|DEFINITION |OPERATION|
|-----------|---------|
|Reducing N dimensions to N-1 dimensions by restricting one dimension to a single value.|Slice|
|Same dimensions but computing a sub-cube by restricting, some of the values of the dimensions.| Dice|
|Aggregates or combines values and reduces number of rows or columns.|Roll-Up|
|Decomposes values and increases number of rows or columns.|Drill Down|

## OLAP Cubes query optimization
* Business users will typically want to slice, dice, rollup and drill-down all the time
* Each such combination will potentially go through all the facts table (suboptimal) 
* The "**GROUP BY CUBE(movie, branch, month)**" will make **<u>one</u> pass through the fact** table and will aggregate all possible combinations of groupings, of length 0,1,2 and 3 e.g:
    |            |          |               |               |
    |------------|----------|---------------|---------------|
    |Total revenue| Revenue by movie| Revenue by movie, branch|Revenue by movie, branch, month| 
    |            |Revenue by branch| Revenue by branch, month||
    |            |Revenue by month|Revenue by movie, month||
* Saving/Materialization the output of the CUBE operation and using it is usually enough to answer all forthcoming aggregations from business users without having to process the whole facts table again

## Exercise 02 - OLAP Cubes
###  Slicing and Dicing
All the databases table in this demo are based on public database samples and transformations
- `Sakila` is a sample database created by `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](http://archive.oreilly.com/oreillyschool/courses/dba3/index.html)

Start by creating and connecting to the database by running the cells below.

In [4]:
# !PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila_star
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila_star -f data/pagila-star.sql

#### Connect to the local database where Pagila is loaded

In [1]:
import sql
%load_ext sql

In [2]:
DB_ENDPOINT = '127.0.0.1'
DB = 'pagila_star'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

postgresql://student:student@127.0.0.1:5432/pagila_star

'Connected: student@pagila_star'

#### Star Schema
<img src="images/pagila-star.png" width="50%"/>

#### Start with a simple cube
Write a query that calculates the revenue (sales_amount) by day, rating, and city. Remember to join with the appropriate dimension tables to replace the keys with the dimension labels. Sort by revenue in descending order and limit to the first 20 rows. The first few rows of your output should match the table below.

In [3]:
%%time
%%sql

SELECT d.day, m.rating, c.city, SUM(s.sales_amount) AS revenue
FROM factsales s JOIN di

....................mdate d ON s.date_key = d.date_key
    JOIN dimmovie m ON s.movie_key = m.movie_key
    JOIN dimcustomer c ON s.customer_key = c.customer_key
GROUP BY (d.day, m.rating, c.city)
ORDER BY revenue DESC
LIMIT 20;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
20 rows affected.
Wall time: 53.4 ms

[(30, 'G', 'San Bernardino', Decimal('24.97')),
 (30, 'NC-17', 'Apeldoorn', Decimal('23.95')),
 (21, 'NC-17', 'Belm', Decimal('22.97')),
 (28, 'R', 'Mwanza', Decimal('21.97')),
 (30, 'PG-13', 'Zanzibar', Decimal('21.97')),
 (21, 'G', 'Citt del Vaticano', Decimal('21.97')),
 (1, 'R', 'Qomsheh', Decimal('19.97')),
 (17, 'G', 'Rajkot', Decimal('19.97')),
 (28, 'PG-13', 'Dhaka', Decimal('19.97')),
 (22, 'R', 'Yangor', Decimal('19.97')),
 (19, 'PG', 'Najafabad', Decimal('19.96')),
 (30, 'R', 'Fengshan', Decimal('19.95')),
 (28, 'PG', 'So Leopoldo', Decimal('18.98')),
 (21, 'G', 'Wroclaw', Decimal('18.98')),
 (1, 'NC-17', 'Memphis', Decimal('18.97')),
 (29, 'PG-13', 'Shimoga', Decimal('18.97')),
 (19, 'PG', 'Sokoto', Decimal('18.97')),
 (30, 'PG-13', 'Osmaniye', Decimal('18.97')),
 (30, 'G', 'Omdurman', Decimal('18.97')),
 (21, 'PG-13', 'Asuncin', Decimal('18.95'))]

#### Slicing

Slicing is the reduction of the dimensionality of a cube by 1 e.g. 3 dimensions to 2, fixing one of the dimensions to a single value. In the example above, we have a 3-dimensional cube on day, rating, and country.

Write a query that reduces the dimensionality of the above example by limiting the results to only include movies with a `rating` of "PG-13". Again, sort by revenue in descending order and limit to the first 20 rows. The first few rows of your output should match the table below.

In [4]:
%%time
%%sql

SELECT d.day, m.rating, c.city, SUM(s.sales_amount) AS revenue
FROM factsales s JOIN dimdate d ON s.date_key = d.date_key
    JOIN dimmovie m ON s.movie_key = m.movie_key
    JOIN dimcustomer c ON s.customer_key = c.customer_key
WHERE m.rating = 'PG-13'
GROUP BY (d.day, m.rating, c.city)
ORDER BY revenue DESC
LIMIT 20;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
20 rows affected.
Wall time: 30.2 ms

[(30, 'PG-13', 'Zanzibar', Decimal('21.97')),
 (28, 'PG-13', 'Dhaka', Decimal('19.97')),
 (30, 'PG-13', 'Osmaniye', Decimal('18.97')),
 (29, 'PG-13', 'Shimoga', Decimal('18.97')),
 (21, 'PG-13', 'Asuncin', Decimal('18.95')),
 (21, 'PG-13', 'Parbhani', Decimal('17.98')),
 (20, 'PG-13', 'Baha Blanca', Decimal('17.98')),
 (30, 'PG-13', 'Nagareyama', Decimal('17.98')),
 (30, 'PG-13', 'Tanauan', Decimal('17.96')),
 (17, 'PG-13', 'Ikerre', Decimal('17.95')),
 (30, 'PG-13', 'Zhoushan', Decimal('16.98')),
 (30, 'PG-13', 'Yerevan', Decimal('16.97')),
 (30, 'PG-13', 'Newcastle', Decimal('16.97')),
 (8, 'PG-13', 'Pontianak', Decimal('15.98')),
 (17, 'PG-13', 'Yantai', Decimal('15.98')),
 (30, 'PG-13', 'Santa Rosa', Decimal('15.98')),
 (20, 'PG-13', 'Santa Rosa', Decimal('15.98')),
 (30, 'PG-13', 'Toulouse', Decimal('15.97')),
 (1, 'PG-13', 'Moscow', Decimal('15.97')),
 (20, 'PG-13', 'Johannesburg', Decimal('15.97'))]

#### Dicing
Dicing is creating a subcube with the same dimensionality but fewer values for  two or more dimensions. 

Write a query to create a subcube of the initial cube that includes moves with:
* ratings of PG or PG-13
* in the city of Bellevue or Lancaster
* day equal to 1, 15, or 30

The first few rows of your output should match the table below.

In [5]:
%%time
%%sql

SELECT d.day, m.rating, c.city, SUM(s.sales_amount) AS revenue
FROM factsales s JOIN dimdate d ON s.date_key = d.date_key
    JOIN dimmovie m ON s.movie_key = m.movie_key
    JOIN dimcustomer c ON s.customer_key = c.customer_key
WHERE m.rating IN ('PG-13','PG') AND
    c.city IN ('Bellevue', 'Lancaster') AND
    d.day IN (1,15,30)
GROUP BY (d.day, m.rating, c.city)
ORDER BY revenue DESC
LIMIT 20;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
6 rows affected.
Wall time: 11.1 ms

[(30, 'PG', 'Lancaster', Decimal('12.98')),
 (1, 'PG-13', 'Lancaster', Decimal('5.99')),
 (30, 'PG-13', 'Bellevue', Decimal('3.99')),
 (30, 'PG-13', 'Lancaster', Decimal('2.99')),
 (15, 'PG-13', 'Bellevue', Decimal('1.98')),
 (1, 'PG', 'Bellevue', Decimal('0.99'))]

### Roll Up and Drill Down

#### Roll-up
- Stepping up the level of aggregation to a large grouping
- e.g.`city` is summed as `country`

Write a query that calculates revenue (sales_amount) by day, rating, and country. Sort the data by revenue in descending order, and limit the data to the top 20 results. The first few rows of your output should match the table below.

In [6]:
%%time
%%sql

SELECT d.day, m.rating, c.country, SUM(s.sales_amount) AS revenue
FROM factsales s JOIN dimdate d ON s.date_key = d.date_key
    JOIN dimmovie m ON s.movie_key = m.movie_key
    JOIN dimcustomer c ON s.customer_key = c.customer_key
GROUP BY (d.day, m.rating, c.country)
ORDER BY revenue DESC
LIMIT 20;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
20 rows affected.
Wall time: 33.5 ms

[(30, 'G', 'China', Decimal('169.67')),
 (30, 'PG', 'India', Decimal('156.67')),
 (30, 'NC-17', 'India', Decimal('153.64')),
 (30, 'PG-13', 'China', Decimal('146.67')),
 (30, 'R', 'China', Decimal('145.66')),
 (30, 'R', 'India', Decimal('143.68')),
 (30, 'G', 'India', Decimal('137.67')),
 (18, 'NC-17', 'India', Decimal('135.75')),
 (30, 'PG', 'China', Decimal('131.72')),
 (21, 'PG-13', 'India', Decimal('128.74')),
 (18, 'PG-13', 'India', Decimal('121.72')),
 (18, 'PG', 'India', Decimal('119.76')),
 (30, 'PG-13', 'India', Decimal('116.72')),
 (21, 'NC-17', 'China', Decimal('115.77')),
 (21, 'R', 'India', Decimal('115.75')),
 (27, 'NC-17', 'India', Decimal('115.72')),
 (17, 'PG-13', 'China', Decimal('111.75')),
 (17, 'NC-17', 'United States', Decimal('109.76')),
 (30, 'NC-17', 'China', Decimal('108.77')),
 (20, 'PG-13', 'India', Decimal('101.79'))]

#### Drill-down
- Breaking up one of the dimensions to a lower level.
- e.g.`city` is broken up into  `districts`

Write a query that calculates revenue (sales_amount) by day, rating, and district. Sort the data by revenue in descending order, and limit the data to the top 20 results. The first few rows of your output should match the table below.

In [7]:
%%time
%%sql

SELECT d.day, m.rating, c.district, SUM(s.sales_amount) AS revenue
FROM factsales s JOIN dimdate d ON s.date_key = d.date_key
    JOIN dimmovie m ON s.movie_key = m.movie_key
    JOIN dimcustomer c ON s.customer_key = c.customer_key
GROUP BY (d.day, m.rating, c.district)
ORDER BY revenue DESC
LIMIT 20;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
20 rows affected.
Wall time: 46.4 ms

[(30, 'PG-13', 'Southern Tagalog', Decimal('53.88')),
 (30, 'G', 'Inner Mongolia', Decimal('38.93')),
 (30, 'G', 'Shandong', Decimal('36.93')),
 (30, 'NC-17', 'West Bengali', Decimal('36.92')),
 (17, 'PG-13', 'Shandong', Decimal('34.95')),
 (1, 'PG', 'California', Decimal('32.94')),
 (18, 'NC-17', 'So Paulo', Decimal('32.93')),
 (21, 'R', 'So Paulo', Decimal('31.93')),
 (30, 'NC-17', 'Buenos Aires', Decimal('31.93')),
 (30, 'PG', 'Southern Tagalog', Decimal('30.94')),
 (30, 'PG', 'So Paulo', Decimal('30.93')),
 (30, 'R', 'Buenos Aires', Decimal('30.92')),
 (18, 'NC-17', 'Maharashtra', Decimal('29.95')),
 (30, 'G', 'California', Decimal('29.95')),
 (21, 'PG-13', 'Uttar Pradesh', Decimal('29.94')),
 (10, 'R', 'Maharashtra', Decimal('29.93')),
 (20, 'PG', 'Shandong', Decimal('29.93')),
 (18, 'R', 'Sumy', Decimal('28.97')),
 (21, 'PG-13', 'Southern Tagalog', Decimal('28.96')),
 (29, 'NC-17', 'So Paulo', Decimal('28.95'))]

### Grouping Sets

- It happens often that for 3 dimensions, you want to aggregate a fact:
    - by nothing (total)
    - then by the 1st dimension
    - then by the 2nd 
    - then by the 3rd 
    - then by the 1st and 2nd
    - then by the 2nd and 3rd
    - then by the 1st and 3rd
    - then by the 1st and 2nd and 3rd
    
- Since this is very common, and in all cases, we are iterating through all the fact table anyhow, there is a more clever way to do that using the SQL grouping statement "GROUPING SETS"

#### Total Revenue
Write a query that calculates total revenue (sales_amount)

In [8]:
%%sql
SELECT SUM(sales_amount) AS revenue
FROM factsales;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
1 rows affected.

[(Decimal('67416.51'),)]

#### Revenue by Country
Write a query that calculates total revenue (sales_amount) by country

In [16]:
%%sql
SELECT st.country, SUM(s.sales_amount) AS revenue
FROM factsales s JOIN dimstore st ON s.store_key = st.store_key
GROUP BY st.country
ORDER BY revenue DESC
LIMIT 10;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
2 rows affected.

[('Australia', Decimal('33726.77')), ('Canada', Decimal('33689.74'))]

#### Revenue by Month
Write a query that calculates total revenue (sales_amount) by month

In [23]:
%%sql
SELECT d.month, SUM(s.sales_amount) AS revenue
FROM factsales s JOIN dimdate d ON s.date_key = d.date_key
GROUP BY d.month
ORDER BY revenue DESC;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
5 rows affected.

[(4, Decimal('28559.46')),
 (3, Decimal('23886.56')),
 (2, Decimal('9631.88')),
 (1, Decimal('4824.43')),
 (5, Decimal('514.18'))]

#### Revenue by Month & Country
Write a query that calculates total revenue (sales_amount) by month and country. Sort the data by month, country, and revenue in descending order. The first few rows of your output should match the table below

In [19]:
%%sql
SELECT d.month, st.country, SUM(s.sales_amount) AS revenue
FROM factsales s JOIN dimstore st ON s.store_key = st.store_key
    JOIN dimdate d ON s.date_key = d.date_key
GROUP BY d.month, st.country
ORDER BY d.month,st.country, revenue DESC
LIMIT 20;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
10 rows affected.

[(1, 'Australia', Decimal('2364.19')),
 (1, 'Canada', Decimal('2460.24')),
 (2, 'Australia', Decimal('4895.10')),
 (2, 'Canada', Decimal('4736.78')),
 (3, 'Australia', Decimal('12060.33')),
 (3, 'Canada', Decimal('11826.23')),
 (4, 'Australia', Decimal('14136.07')),
 (4, 'Canada', Decimal('14423.39')),
 (5, 'Australia', Decimal('271.08')),
 (5, 'Canada', Decimal('243.10'))]

#### Revenue Total, by Month, by Country, by Month & Country All in one shot
Write a query that calculates total revenue at the various grouping levels done above (total, by month, by country, by month & country) all at once using the grouping sets function. Your output should match the table below.

In [25]:
%%sql
SELECT d.month, st.country, SUM(s.sales_amount) AS revenue
FROM factsales s JOIN dimstore st ON s.store_key = st.store_key
    JOIN dimdate d ON s.date_key = d.date_key
GROUP BY GROUPING SETS ((), (st.country),(d.month), (d.month, st.country))
ORDER BY d.month,st.country, revenue DESC
LIMIT 20;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
18 rows affected.

[(1, 'Australia', Decimal('2364.19')),
 (1, 'Canada', Decimal('2460.24')),
 (1, None, Decimal('4824.43')),
 (2, 'Australia', Decimal('4895.10')),
 (2, 'Canada', Decimal('4736.78')),
 (2, None, Decimal('9631.88')),
 (3, 'Australia', Decimal('12060.33')),
 (3, 'Canada', Decimal('11826.23')),
 (3, None, Decimal('23886.56')),
 (4, 'Australia', Decimal('14136.07')),
 (4, 'Canada', Decimal('14423.39')),
 (4, None, Decimal('28559.46')),
 (5, 'Australia', Decimal('271.08')),
 (5, 'Canada', Decimal('243.10')),
 (5, None, Decimal('514.18')),
 (None, 'Australia', Decimal('33726.77')),
 (None, 'Canada', Decimal('33689.74')),
 (None, None, Decimal('67416.51'))]

### CUBE 
- Group by CUBE (dim1, dim2, ..) , produces all combinations of different lenghts in one go.
- This view could be materialized in a view and queried which would save lots repetitive aggregations

Write a query that calculates the various levels of aggregation done in the grouping sets exercise (total, by month, by country, by month & country) using the CUBE function. Your output should match the table below.

In [29]:
%%time
%%sql
SELECT d.month, st.country, SUM(s.sales_amount) AS revenue
FROM factsales s JOIN dimstore st ON s.store_key = st.store_key
    JOIN dimdate d ON s.date_key = d.date_key
GROUP BY CUBE(d.month,st.country)
ORDER BY d.month, st.country, revenue DESC;

 * postgresql://student:***@127.0.0.1:5432/pagila_star
18 rows affected.
Wall time: 25.4 ms

[(1, 'Australia', Decimal('2364.19')),
 (1, 'Canada', Decimal('2460.24')),
 (1, None, Decimal('4824.43')),
 (2, 'Australia', Decimal('4895.10')),
 (2, 'Canada', Decimal('4736.78')),
 (2, None, Decimal('9631.88')),
 (3, 'Australia', Decimal('12060.33')),
 (3, 'Canada', Decimal('11826.23')),
 (3, None, Decimal('23886.56')),
 (4, 'Australia', Decimal('14136.07')),
 (4, 'Canada', Decimal('14423.39')),
 (4, None, Decimal('28559.46')),
 (5, 'Australia', Decimal('271.08')),
 (5, 'Canada', Decimal('243.10')),
 (5, None, Decimal('514.18')),
 (None, 'Australia', Decimal('33726.77')),
 (None, 'Canada', Decimal('33689.74')),
 (None, None, Decimal('67416.51'))]

#### Revenue Total, by Month, by Country, by Month & Country All in one shot, NAIVE way
The naive way to create the same table as above is to write several queries and UNION them together. Grouping sets and cubes produce queries that are shorter to write, easier to read, and more performant. Run the naive query below and compare the time it takes to run to the time it takes the cube query to run.

In [30]:
%%time
%%sql
SELECT  NULL as month, NULL as country, sum(sales_amount) as revenue
FROM factSales
    UNION all 
SELECT NULL, dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by  dimStore.country
    UNION all 
SELECT cast(dimDate.month as text) , NULL, sum(sales_amount) as revenue
FROM factSales
JOIN dimDate on (dimDate.date_key = factSales.date_key)
GROUP by dimDate.month
    UNION all
SELECT cast(dimDate.month as text),dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by (dimDate.month, dimStore.country)

 * postgresql://student:***@127.0.0.1:5432/pagila_star
18 rows affected.
Wall time: 43.9 ms

[(None, None, Decimal('67416.51')),
 (None, 'Canada', Decimal('33689.74')),
 (None, 'Australia', Decimal('33726.77')),
 ('4', None, Decimal('28559.46')),
 ('3', None, Decimal('23886.56')),
 ('1', None, Decimal('4824.43')),
 ('5', None, Decimal('514.18')),
 ('2', None, Decimal('9631.88')),
 ('1', 'Australia', Decimal('2364.19')),
 ('5', 'Canada', Decimal('243.10')),
 ('3', 'Australia', Decimal('12060.33')),
 ('3', 'Canada', Decimal('11826.23')),
 ('4', 'Canada', Decimal('14423.39')),
 ('1', 'Canada', Decimal('2460.24')),
 ('4', 'Australia', Decimal('14136.07')),
 ('5', 'Australia', Decimal('271.08')),
 ('2', 'Canada', Decimal('4736.78')),
 ('2', 'Australia', Decimal('4895.10'))]

## Exercise 03 - Columnar Vs Row Storage
- The columnar storage extension used here: 
    - cstore_fdw by citus_data [https://github.com/citusdata/cstore_fdw](https://github.com/citusdata/cstore_fdw)
- The data tables are the ones used by citus_data to show the storage extension